трансляция((P1-->P2),(G1:-G2)):-
	левая_часть(P1,S0,S,G1),
	правая_часть(P2,S0,S,G2).
левая_часть(P0,S0,S,G):-
	nonvar(P0),
	tag(P0,S0,S,G).
правая_часть((P1,P2),S0,S,G):-!,
	правая_часть(P1,S0,S1,G1),
	правая_часть(P2,S1,S,G2),
	и (G1,G2,G).
правая_часть(P,S0,S,true):-
	явл_списком(P),!,
	присоединить(P,S,S0).
правая_часть(P,S0,S,G):-
	tag(P,S0,S,G).
tag(P,S0,S,G):-
	atom(P),
	G = ..[P,S0,S].
и(true,G,G):-!.
и(G,true,G):-!.
и(G1,G2,(G1,G2)).
явл_списком([]):-!.
явл_списком([_|_]).
присоединить([A|B],C,[A|D]):-присоединить(B,C,D).
присоединить([],X,X).
